## 데이터 구조 
### Series 
### Data Frame

#### Series

In [1]:
import pandas as pd

In [3]:
s = pd.Series(['banana', 42])

In [4]:
s

0    banana
1        42
dtype: object

In [9]:
s = pd.Series(['Wes McKiney' , 'Creator of Pandas'],index=['Person','Who']) ## index 설정 가능

In [14]:
s

Person          Wes McKiney
Who       Creator of Pandas
dtype: object

In [15]:
Scientists = pd.DataFrame({
    'Name' : ['Rosaline Franklin', 'Wiliam Gosset'],
    'Occupation' : ['Chemist', 'Stattistician'],
    'Born' : ['1920-07-25', '1876-06-13'], 
    'Died' : ['1958-04-16', '1937-10-16'], 
    'Age' : [37,61]
})

In [16]:
Scientists ## index 따로 지정 하지않으면 0 과 1로 나타나있다.

                Name     Occupation        Born        Died  Age
0  Rosaline Franklin        Chemist  1920-07-25  1958-04-16   37
1      Wiliam Gosset  Stattistician  1876-06-13  1937-10-16   61

In [19]:
Scientists = pd.DataFrame(

    data = 
    {
    'Occupation' : ['Chemist', 'Stattistician'],
    'Born' : ['1920-07-25', '1876-06-13'], 
    'Died' : ['1958-04-16', '1937-10-16'], 
    'Age' : [37,61]
},
    index = ['Rosaline Franklin', 'Wiliam Gosset'],
    columns  = ['Occupation', 'Born', 'Age', 'Died']
)

In [20]:
Scientists ## colums 와 인덱스로 행과 열에 대한 이름 을 붙일 수 있다.

                      Occupation        Born  Age        Died
Rosaline Franklin        Chemist  1920-07-25   37  1958-04-16
Wiliam Gosset      Stattistician  1876-06-13   61  1937-10-16

In [25]:
from collections import OrderedDict

Scientists = pd.DataFrame(OrderedDict({
    'Name' : ['Rosaline Franklin', 'Wiliam Gosset'],
    'Occupation' : ['Chemist', 'Stattistician'],
    'Born' : ['1920-07-25', '1876-06-13'], 
    'Died' : ['1958-04-16', '1937-10-16'], 
    'Age' : [37,61]
}))

In [26]:
Scientists

                Name     Occupation        Born        Died  Age
0  Rosaline Franklin        Chemist  1920-07-25  1958-04-16   37
1      Wiliam Gosset  Stattistician  1876-06-13  1937-10-16   61

## Series 다루는 방법

In [28]:
Scientists = pd.DataFrame(

    data = 
    {
    'Occupation' : ['Chemist', 'Stattistician'],
    'Born' : ['1920-07-25', '1876-06-13'], 
    'Died' : ['1958-04-16', '1937-10-16'], 
    'Age' : [37,61]
},
    index = ['Rosaline Franklin', 'Wiliam Gosset'],
    columns  = ['Occupation', 'Born', 'Age', 'Died']
)
Scientists

                      Occupation        Born  Age        Died
Rosaline Franklin        Chemist  1920-07-25   37  1958-04-16
Wiliam Gosset      Stattistician  1876-06-13   61  1937-10-16

In [32]:
row  = Scientists.loc['Wiliam Gosset']
row
type(row) 
## 시리즈 형태인것도 확인 가능하다 . 
## 시리즈에서는 1차원 데이터 차원 벡터이고 데이터 타입이 object이다 . 문자열과 숫자가 섞여 있기 떄문에

pandas.core.series.Series

In [34]:
Scientists.info() #object, int 로 다다른다.

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, Rosaline Franklin to Wiliam Gosset
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Occupation  2 non-null      object
 1   Born        2 non-null      object
 2   Age         2 non-null      int64
 3   Died        2 non-null      object
dtypes: int64(1), object(3)
memory usage: 188.0+ bytes

In [35]:
row.index

Index(['Occupation', 'Born', 'Age', 'Died'], dtype='object')

In [36]:
row.values

array(['Stattistician', '1876-06-13', 61, '1937-10-16'], dtype=object)

In [37]:
row.keys() #row.index 값과 같아진다. index 로 사용되어지기 때문에

Index(['Occupation', 'Born', 'Age', 'Died'], dtype='object')

In [38]:
row.index[0]

'Occupation'

In [39]:
row.keys()[0] # 인덱싱에서 dic 에서는 따로 리스트로 바꿔줘야하는데 series 와 datafarame 에서는 인덱싱 가능하다.

'Occupation'

In [40]:
ages = Scientists['Age']

In [41]:
ages
## series 형태로 가져올 수 있다 . 
## data frame 은 series 가 여러가지가 모여서 구성된것을 알 수 있다.

Rosaline Franklin    37
Wiliam Gosset        61
Name: Age, dtype: int64

In [43]:
ages.mean() #평균 값 추출

49.0

In [44]:
ages.max()

61

In [46]:
ages.std() # 표준편차 추출

16.97056274847714

## boolean 추출

In [69]:
scientists  = pd.read_csv('./data-4/scientists.csv')
scientists

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [50]:
ages = scinetists['Age']

In [51]:
ages.mean()

59.125

In [53]:
ages[ages > ages.mean()] # [] 안에 조건문 삽입 가능  # 59.125 보다 나이가 많은 사람을 추출가능하다.

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

In [54]:
ages > ages.mean() # boolean 타입으로 조건식으로 만족한 값만 추출을 할 수 있는 구조이다.

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

In [55]:
ages + ages ## 벡터합

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [56]:
ages + 100 # 스칼라합

0    137
1    161
2    190
3    166
4    156
5    145
6    141
7    177
Name: Age, dtype: int64

In [58]:
pd.Series([1,100])
ages + pd.Series([1,100]) # 결측치 nan

0     38.0
1    161.0
2      NaN
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
dtype: float64

In [59]:
ages.sort_index() # 오름차순으로 자동 배열

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [61]:
rev_ages = ages.sort_index(ascending = False)
ages + rev_ages

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [63]:
rev_ages = ages.sort_index(ascending = False)
rev_ages # 역순으로 추출

7    77
6    41
5    45
4    56
3    66
2    90
1    61
0    37
Name: Age, dtype: int64

In [70]:
scientists['Age']

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [72]:
scientists['Age'] > scientists['Age'].mean()

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

##### dataframe scalar 연산

In [73]:
scientists *2

,Name,Born,Died,Age,Occupation
0,Rosaline FranklinRosaline Franklin,1920-07-251920-07-25,1958-04-161958-04-16,74,ChemistChemist
1,William GossetWilliam Gosset,1876-06-131876-06-13,1937-10-161937-10-16,122,StatisticianStatistician
2,Florence NightingaleFlorence Nightingale,1820-05-121820-05-12,1910-08-131910-08-13,180,NurseNurse
3,Marie CurieMarie Curie,1867-11-071867-11-07,1934-07-041934-07-04,132,ChemistChemist
4,Rachel CarsonRachel Carson,1907-05-271907-05-27,1964-04-141964-04-14,112,BiologistBiologist
5,John SnowJohn Snow,1813-03-151813-03-15,1858-06-161858-06-16,90,PhysicianPhysician
6,Alan TuringAlan Turing,1912-06-231912-06-23,1954-06-071954-06-07,82,Computer ScientistComputer Scientist
7,Johann GaussJohann Gauss,1777-04-301777-04-30,1855-02-231855-02-23,154,MathematicianMathematician

In [74]:
scientists + scientists ## dataframe 끼리 더해주기

,Name,Born,Died,Age,Occupation
0,Rosaline FranklinRosaline Franklin,1920-07-251920-07-25,1958-04-161958-04-16,74,ChemistChemist
1,William GossetWilliam Gosset,1876-06-131876-06-13,1937-10-161937-10-16,122,StatisticianStatistician
2,Florence NightingaleFlorence Nightingale,1820-05-121820-05-12,1910-08-131910-08-13,180,NurseNurse
3,Marie CurieMarie Curie,1867-11-071867-11-07,1934-07-041934-07-04,132,ChemistChemist
4,Rachel CarsonRachel Carson,1907-05-271907-05-27,1964-04-141964-04-14,112,BiologistBiologist
5,John SnowJohn Snow,1813-03-151813-03-15,1858-06-161858-06-16,90,PhysicianPhysician
6,Alan TuringAlan Turing,1912-06-231912-06-23,1954-06-071954-06-07,82,Computer ScientistComputer Scientist
7,Johann GaussJohann Gauss,1777-04-301777-04-30,1855-02-231855-02-23,154,MathematicianMathematician

In [76]:
scientists['Born'].dtype ## 대문자 O  = Object

dtype('O')

In [77]:
scientists['Died'].dtype 
## 대문자 O  = Object 
## 날짜를 문자열로 저장한거는 시간으로 바꿔주는것이 좋다

dtype('O')

In [81]:
## 날자 형식으로 바꾸기 method 
pd.to_datetime(scientists['Born'], format = '%Y-%m-%d') # %Y 는 4자리 , %y는 소문자이면 2자리 

scientists['Born'] = pd.to_datetime(scientists['Born'], format = '%Y-%m-%d')

In [82]:
scientists['Born'].dtype # 바뀐걸 확인가능하다 .

dtype('<M8[ns]')

In [83]:
scientists['Died'] = pd.to_datetime(scientists['Died'], format = '%Y-%m-%d')

In [84]:
scientists.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Born        8 non-null      datetime64[ns]
 2   Died        8 non-null      datetime64[ns]
 3   Age         8 non-null      int64
 4   Occupation  8 non-null      object
dtypes: datetime64[ns](2), int64(1), object(2)
memory usage: 448.0+ bytes

In [85]:
scientists = pd.read_csv('./data-4/scientists.csv')

In [92]:
# 새로운 칼럼 추가 
scientists['Born_dt'] = pd.to_datetime(scientists['Born'], format = '%Y-%m-%d') 
scientists['Died_dt'] =  pd.to_datetime(scientists['Died'], format = '%Y-%m-%d')

In [93]:
scientists

,Name,Born,Died,Age,Occupation,Born_dt,Died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23

In [94]:
scientists['ages_dats_dt'] = (scientists['Died_dt'] - scientists['Born_dt'])

In [95]:
scientists

,Name,Born,Died,Age,Occupation,Born_dt,Died_dt,ages_dats_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23,28422 days

In [96]:
import random

In [99]:
## 랜덤으로 age 를 섞는 방법 

random.seed(42)
random.shuffle(scientists['Age'])
scientists['Age']

/opt/homebrew/Cellar/python@3.9/3.9.10/Frameworks/Python.framework/Versions/3.9/lib/python3.9/random.py:362: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  x[i], x[j] = x[j], x[i]

0    77
1    90
2    37
3    61
4    41
5    45
6    66
7    56
Name: Age, dtype: int64

In [100]:
scientists.columns

Index(['Name', 'Born', 'Died', 'Age', 'Occupation', 'Born_dt', 'Died_dt',
       'ages_dats_dt'],
      dtype='object')

In [102]:
scientists # 잘못들어간 age columns 확인

,Name,Born,Died,Age,Occupation,Born_dt,Died_dt,ages_dats_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,77,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,90,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,37,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,61,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,41,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,66,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,56,Mathematician,1777-04-30,1855-02-23,28422 days

In [103]:
scientists_dropped = scientists.drop(['Age'], axis = 1  ) # axis = 1 의미는 column 기준으로 삭제

In [104]:
scientists_dropped

,Name,Born,Died,Occupation,Born_dt,Died_dt,ages_dats_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,Mathematician,1777-04-30,1855-02-23,28422 days

# 피클 형태로 저장하는 방법 

## 피클형태는 저장용량이 더 작은편

In [107]:
names = scientists['Name']

In [108]:
names.to_pickle('scientists_name_s.pickle')

In [109]:
scientists_name_from_picle = pd.read_pickle('./scientists_name_s.pickle')

In [110]:
scientists_name_from_picle

0       Rosaline Franklin
1          William Gosset
2    Florence Nightingale
3             Marie Curie
4           Rachel Carson
5               John Snow
6             Alan Turing
7            Johann Gauss
Name: Name, dtype: object

In [112]:
scientists.to_pickle ('scientist_df.pickle')

In [113]:
scientists_from_pickle = pd.read_pickle('scientist_df.pickle')

In [114]:
scientists_from_pickle

,Name,Born,Died,Age,Occupation,Born_dt,Died_dt,ages_dats_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,77,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,90,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,37,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,61,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,41,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,66,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,56,Mathematician,1777-04-30,1855-02-23,28422 days

In [115]:
names.to_csv('scientist_names_series.csv') # series 를 csv파일로 나타내기

In [116]:
scientists.to_csv('scientist_df.csv') #

In [117]:
scientists.to_csv('scientist_df.tsv', sep = '\t')